# taps
tap "homebrew/cask" # extends Homebrew to install GUI macOS applications
tap "microsoft/git" # for Git Credential Manager

# brews
brew "autojump"
brew "bash-completion"
brew "ffmpeg" # for youtube-dl audio extraction
brew "git"
brew "hub"
brew "kubectx"
brew "kubernetes-cli"
brew "mas"
brew "php" # for https://github.com/gharlan/alfred-github-workflow
brew "prettier"
brew "tldr"
brew "watch"
brew "wget"
brew "youtube-dl"

# casks
cask "1password"
cask "alfred"
cask "anylist"
cask "audiobook-builder"
cask "authy"
cask "choosy"
cask "cleanshot"
cask "daisydisk"
cask "fantastical"
cask "firefox"
cask "flotato"
cask "google-chrome"
cask "google-drive"
cask "handbrake"
cask "istat-menus"
cask "iterm2"
cask "maestral"
cask "mimestream"
cask "moom"
cask "postman"
cask "rocket"
cask "slack"
cask "soundsource"
cask "soulver2"
cask "sublime-merge"
cask "the-archive"
cask "transmit"
cask "vlc"
cask "visual-studio-code"
cask "zoom"

# Mac App Store
mas "Brother iPrint&Scan", id: 1193539993
mas "Deliveries: a package tracker", id: 290986013
mas "Drop Shadow", id: 484550417
mas "Froq", id: 894339623
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Speedtest by Ookla", id: 1153157709
mas "Things 3", id: 904280696
mas "wifi-explorer", id: 494803304
