# Use brew bundle --file Brewfile-personal

# taps
tap "microsoft/git" # for Git Credential Manager

# brews
brew "autojump"
brew "bash-completion"
brew "ffmpeg" # for youtube-dl audio extraction
brew "git"
brew "gh" # GitHub CLI
brew "hub"
brew "mas"
brew "nodenv" # run nodenv init in your shell to enable
brew "node-build"
brew "php" # for https://github.com/gharlan/alfred-github-workflow
brew "pyenv" # run pyenv init in your shell to enable
brew "prettier"
brew "rbenv" # run rbenv init in your shell to enable
brew "ruby-build"
brew "shellcheck" # for shell script linting
brew "tldr"
brew "watch"
brew "wget"
# brew "youtube-dl" # install manually, see personal notes

# casks
cask "1password"
cask "acorn"
cask "alfred"
cask "anylist"
cask "audiobook-builder"
cask "basecamp"
cask "brainfm"
cask "choosy"
cask "cleanshot"
cask "cursor"
cask "daisydisk"
cask "discord"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "handbrake-app"
cask "jordanbaird-ice@beta"
cask "istat-menus"
cask "iterm2"
cask "maestral"
# cask "magic-switch" # not available on Homebrew Cask at this time
cask "mimestream"
cask "mullvad-vpn"
cask "moom"
cask "rocket"
cask "soulver"
cask "sqlpro-studio"
cask "steam"
cask "sublime-merge"
cask "the-archive"
cask "transmit"
cask "vlc"

# Mac App Store
mas "Brother iPrint&Scan", id: 1193539993
# mas "Paprika Recipe Manager 3", id: 1303222628 # errors, install manually in App Store
mas "Parcel - Delivery Tracking", id: 375589283
mas "Speedtest by Ookla", id: 1153157709
mas "Things 3", id: 904280696
# mas "WiFi Explorer: Scanner", id: 494803304 # errors, install manually in App Store
