# taps
tap "microsoft/git" # for Git Credential Manager

# brews
brew "autojump"
brew "bash-completion"
brew "ffmpeg" # for youtube-dl audio extraction
brew "git"
brew "gh" # GitHub CLI
brew "hub"
brew "kubectx"
brew "kubernetes-cli"
brew "mas"
brew 'nodenv' # run nodenv init in your shell to enable
brew 'node-build'
brew "php" # for https://github.com/gharlan/alfred-github-workflow
brew "pyenv" # run pyenv init in your shell to enable
brew "prettier"
brew "rbenv" # run rbenv init in your shell to enable
brew "ruby-build"
brew "shellcheck" # for shell script linting
brew "tldr"
brew "watch"
brew "wget"
# brew "youtube-dl" # install manually, see personal notes

# casks
cask "1password"
cask "acorn"
cask "alfred"
cask "anylist"
cask "audiobook-builder"
cask "authy"
cask "basecamp"
cask "choosy"
cask "cleanshot"
cask "cursor"
cask "daisydisk"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "handbrake"
cask "istat-menus"
cask "iterm2"
cask "maestral"
cask "mimestream"
cask "moom"
cask "orbstack"
cask "postman"
cask "rocket"
cask "slack"
cask "soulver"
cask "sublime-merge"
cask "the-archive"
cask "transmit"
cask "vlc"
cask "zoom"

# Mac App Store
mas "Brother iPrint&Scan", id: 1193539993
mas "Froq", id: 894339623
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Parcel - Delivery Tracking", id: 639968404
mas "Speedtest by Ookla", id: 1153157709
mas "Things 3", id: 904280696
mas "wifi-explorer", id: 494803304
