# taps
tap "caskroom/cask" # extends Homebrew to install GUI macOS applications

# brews
brew "autojump"
brew "bash-completion"
brew "git"
brew "hub"
brew "mas"
brew "postgresql", restart_service: :changed
brew "prettier"
brew "tldr"
brew "watch"
brew "wget"

# casks

cask "anylist"
cask "audiobook-builder"
cask "backblaze"
cask "bartender"
cask "brooklyn"
cask "daisydisk"
cask "fantastical"
cask "firefox"
cask "fluid"
cask "flux"
cask "google-chat"
cask "google-chrome"
cask "google-backup-and-sync"
cask "handbrake"
cask "istat-menus"
cask "iterm2"
cask "mailplane"
cask "moom"
cask "mysqlworkbench"
cask "nvalt"
cask "postman"
cask "qsync-client"
cask "rowanj-gitx"
cask "slack"
cask "soulver"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "transmit"
cask "textexpander5"
cask "vlc"

# Mac App Store
mas "Be Focused Pro - Focus Timer & Goal Tracker", id: 961632517
mas "Deliveries", id: 924726344
mas "Drop Shadow", id: 484550417
mas "Froq", id: 894339623
mas "GIPHY Capture. The GIF Maker", id: 668208984
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Speedtest by Ookla", id: 1153157709
mas "Things 3", id: 904280696
mas "Tweetbot for Twitter", id: 557168941
mas "wifi-explorer", id: 494803304

# I always install and configure these manually before getting Strap'd AF
# cask "1password"
# cask "alfred"
# cask "dropbox"
